-- phpMyAdmin SQL Dump
-- version 4.9.5
-- https://www.phpmyadmin.net/
--
-- ホスト: localhost:8889
-- 生成日時: 
-- サーバのバージョン： 5.7.24
-- PHP のバージョン: 7.4.1

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- データベース: `test`
--

-- --------------------------------------------------------

--
-- テーブルの構造 `category`
--

CREATE TABLE `category` (
  `ID` int(11) NOT NULL,
  `category` varchar(128) NOT NULL,
  `category2` varchar(128) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- テーブルのデータのダンプ `category`
--

INSERT INTO `category` (`ID`, `category`, `category2`) VALUES
(1, '日本史', '日本史'),
(2, '日本史', '室町'),
(3, '日本史', '戦国'),
(4, '日本史', '幕末'),
(5, '世界史', '世界史'),
(6, '世界史', 'キリスト教'),
(7, '都道府県', '都道府県'),
(8, '都道府県', '神奈川'),
(9, '都道府県', '高知'),
(10, '日本の昔話', '日本の昔話'),
(11, '建物', '建物'),
(12, '建物', '寺'),
(13, '建物', '橋'),
(14, 'スポーツ', 'スポーツ'),
(15, 'スポーツ', '球技'),
(16, 'スポーツ', '武道'),
(17, 'スポーツ', 'ウィンタースポーツ'),
(18, 'スポーツ', 'ラケット'),
(19, 'スポーツ', 'プール'),
(20, 'スポーツ', '格闘技'),
(21, 'スポーツ', '陸上競技'),
(22, 'スポーツ', '体操'),
(23, 'スポーツ', '運動会'),
(24, 'スポーツ', '野球'),
(25, 'スポーツ', 'サッカー'),
(26, 'スポーツ', '相撲'),
(27, 'スポーツ', 'マリンスポーツ'),
(28, 'スポーツ', '筋肉'),
(29, 'スポーツ', '縄跳び'),
(30, 'スポーツ', 'オリンピック'),
(31, 'スポーツ', '大会'),
(32, '絵画', '絵画'),
(33, '絵画', '屏風'),
(34, '人間', '人間'),
(35, '人間', '老人'),
(36, '夏', '夏'),
(37, '冬', '冬'),
(38, '冬', '雪'),
(39, '冬', '雪山'),
(40, '学校', '学校'),
(41, '学校', '運動会'),
(42, '食べ物', '食べ物'),
(43, '食べ物', 'パン'),
(44, '食べ物', '砂糖'),
(45, '食べ物', '海藻'),
(46, '食べ物', 'きのこ'),
(47, '道具', '道具'),
(48, '道具', 'ハンマー'),
(49, '道具', '槍'),
(50, '道具', '弓'),
(51, '道具', '武器'),
(52, '道具', 'テント'),
(53, '道具', '時計'),
(54, '道具', '方位磁針'),
(55, '道具', 'おもちゃ'),
(56, '道具', '鉄砲'),
(57, '道具', '剣/刀'),
(58, '自然', '自然'),
(59, '自然', '水'),
(60, '自然', '光'),
(61, '自然', '災害'),
(62, '自然', '火'),
(63, '自然', '岩'),
(64, '自然', '灰'),
(65, '自然', '土'),
(66, '自然', '氷'),
(67, '自然', '夜'),
(68, '自然', '砂'),
(69, '天気', '天気'),
(70, '天気', '雪'),
(71, '天気', '雨'),
(72, '天気', '雲'),
(73, '天気', '風'),
(74, '天気', '太陽'),
(75, '火', '火'),
(76, '宇宙', '宇宙'),
(77, '宇宙', '星'),
(78, '宇宙', 'クレーター'),
(79, '宇宙', '地球'),
(80, '宇宙', '月'),
(81, '自然科学', '自然科学'),
(82, '自然科学', '実験道具'),
(83, '自然科学', '電気'),
(84, '数学', '数学'),
(85, '人体', '人体'),
(86, '人体', '手首'),
(87, '人体', '臓器'),
(88, '人体', '目'),
(89, '世界地図', '世界地図'),
(90, '世界地図', '北極'),
(91, '世界地図', '南極'),
(92, '世界地図', 'アフリカ'),
(93, '世界地図', 'オーストラリア'),
(94, '観光地', '観光地'),
(95, '観光地', 'ピラミッド'),
(96, '文房具', '文房具'),
(97, 'イベント', 'イベント'),
(98, 'イベント', '正月'),
(99, 'イベント', 'クリスマス'),
(100, '色', '色'),
(101, '色', '黄色'),
(102, '色', '赤'),
(103, '色', '黒'),
(104, '色', '灰色'),
(105, '色', '茶色'),
(106, '色', '緑'),
(107, '色', 'ピンク'),
(108, '色', 'しましま'),
(109, '乗り物', '乗り物'),
(110, '乗り物', '飛行機'),
(111, '動物', '動物'),
(112, '動物', 'うさぎ'),
(113, '動物', 'こうもり'),
(114, '動物', 'ラクダ'),
(115, '動物', '犬'),
(116, '動物', '猫'),
(117, '動物', '家畜'),
(118, '動物', 'ツノ'),
(119, '動物', '小動物'),
(120, '動物', '針'),
(121, '想像上の動物', '想像上の動物'),
(122, '想像上の動物', '雷神'),
(123, '虫', '虫'),
(124, '虫', '羽'),
(125, '虫', '殻'),
(126, '植物', '植物'),
(127, '植物', '木'),
(128, '植物', '葉'),
(129, '鳥', '鳥'),
(130, '鳥', '翼'),
(131, '恐竜', '恐竜'),
(132, '爬虫類', '爬虫類'),
(133, '爬虫類', '甲羅'),
(134, '海の生物', '海の生物'),
(135, '海の生物', '魚'),
(136, '川の生物', '川の生物'),
(137, '川の生物', '魚'),
(138, '状態', '状態'),
(139, '状態', '細長い');

--
-- ダンプしたテーブルのインデックス
--

--
-- テーブルのインデックス `category`
--
ALTER TABLE `category`
  ADD PRIMARY KEY (`ID`);

--
-- ダンプしたテーブルのAUTO_INCREMENT
--

--
-- テーブルのAUTO_INCREMENT `category`
--
ALTER TABLE `category`
  MODIFY `ID` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=140;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
